#### Terraform Apply 🎬`success`

<details><summary>Show Result</summary>

```

terraform
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
data.aws_security_group.ecs: Reading...
data.aws_vpc.vpc: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=demo-fargate-app-ecsTaskRole]
aws_ecr_repository.app_container_repo: Refreshing state... [id=demo-fargate-app]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=demo-fargate-app-logs]
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 0s [id=aws]
data.aws_security_group.ecs: Read complete after 0s [id=sg-0a4da3a6cadecdb46]
data.aws_lb_listener.alb_listener: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole-20230116161620443900000002]
aws_ecs_task_definition.task_def: Refreshing state... [id=demo-fargate-app]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-09588034d45d4bae9]
data.aws_subnets.subnets: Reading...
aws_lb_target_group.alb_ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230116161619809000000001/18aa39592593ee28]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
aws_lb_listener_rule.listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/6f83dee41c11cc28]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:service/ecs-fargate/demo-fargate-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:369168831564:task-definition/demo-fargate-app:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-region        = "" -> "us-east-1"
                            # (2 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    }
                  - mountPoints      = [] -> null
                    name             = "demo-fargate-app"
                  - volumesFrom      = [] -> null
                    # (3 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "demo-fargate-app" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "environment" = "dev"
            "project"     = "demo"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.task_def: Destroying... [id=demo-fargate-app]
aws_ecs_task_definition.task_def: Destruction complete after 0s
aws_ecs_task_definition.task_def: Creating...
aws_ecs_task_definition.task_def: Creation complete after 0s [id=demo-fargate-app]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>
